while True:
    a, b = map(int, input().split())
    # 마지막 입력에는 0 두개가 들어간다. 즉, a와 b가 0이 되면, 이 반복문은 끝이나게되므로, 마지막에 break를 넣어준다.
    if (a == 0 and b == 0):
        break
    # 그 외의 숫자들은 모두 a+b로 출력할 필요성이 있으므로 식을 적어준다.
    else:
        print(a+b)


# 나의 첫번째 해답
# 반성: 먼저 변수를 지정해주는 것은 좋았으나, 해당 문제는 무한루프로 식을 작성해야 했었다. 왜냐하면 변수를 지정해주지 않고, 숫자 2개를 넣어준다 했을 뿐이니까....
# 그러므로, 변수선언이 먼저가 아닌, "while Ture:" 로 먼저 무한루프임을 인식 시켜주는 것이 좋다.
# 마지막에 숫자 0과 0이 들어가면 이 반복문은 종료한다고 문제에 나와있었다. 이말인 즉슨, 반복문으로 부터 빠져나오는 것은 0 0 이 입력되었을 때 break를 사용해야한다는 점.
# 즉, 조건문 if를 사용하여 a == 0, b == 0 일때 종료한다는 식을 적어줄 필요가 있었다.
a, b = list(map(int, input().split()))
c = a+b

while c < 20:
    print(c)
    break
