# While문
# 조건이 참인 동안 계속 반복합니다.
# 조건을 조절하기 위해 조건문을 while문 내부에서 핸들링 해야합니다.

c = 5
while c != 0:
    print(c)
    c -= 1  # 5, 4, 3, 2, 1


# break문
# break문은 while, for문과 같은 반복문 안에서 특정조건에서 반복문을 중단시키고 빠져나올 때 사용합니다.
# 아래 구문 중 input은 콘솔창에서 메세지를 보여주고 사용자 입력을 받습니다.
# %는 숫자를 나누고 나머지를 반환하는 연산자입니다.

# 아래 식은 무한루프 속에서 10으로 나누었을 때, 나머지가 0인 경우 break문으로 반복문을 중단하고 빠져나오는 예제입니다.
while True:  # 무한루프입니다.
    response = input('숫자를 입력하세요:')
    if int(response) % 10 == 0:
        print('10으로 나누었을 때 나머지가 0입니다.')
        break
